try:
    txt = """Python (найчастіше вживане прочитання — «Па́йтон», запозичено назву[8] з 
    британського шоу Монті Пайтон) — інтерпретована об'єктно-орієнтована мова програмування високого 
    рівня із суворою динамічною типізацією[9]. pозроблена в 1990 році Гвідо ван Россумом. 
    Структури даних високого рівня разом із динамічною семантикою та динамічним зв'язуванням роблять її 
    привабливою для швидкої розробки програм, а також як засіб поєднування наявних компонентів. 
    Python підтримує модулі та пакети модулів, що сприяє модульності та повторному використанню коду. 
    Інтерпретатор Python та стандартні бібліотеки доступні як у скомпільованій, так і у вихідній формі на всіх основних платформах. 
    В мові програмування Python підтримується кілька парадигм програмування, зокрема: об'єктно-орієнтована, процедурна, 
    аспектно-орієнтована та функціональна!"""
    # i = j = 0
    # num_count = 0
    # while i < len(txt)-2:
    #     i += 1
    #     if txt[i] == ".":
    #         txt[i+2] = txt[i+2].upper()
    # num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 0]
    # while j < len(txt):
    #     if txt[j] in num:
    #         num_count += 1
    # print(num_count)
    # print(txt)
    sign = txt.count(",") + txt.count(".")
    x = txt.count("!")
    print(sign)
    print(x)
except Exception as e:
    print(e)